name: "adult"
input: "C0"
input_shape {
  dim: 64
  dim: 1
}
layer {
  name: "ip"
  type: "InnerProduct"
  bottom: "C0"
  top: "ip"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  inner_product_param {
    num_output: 10
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "prob"
  type: "Softmax"
  bottom: "ip"
  top: "prob"
}
